# GetVertices Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshFacet..::..GetVertices Method
PolymeshFacet Class See Also
---
Returns the three vertices that define this facet
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<int> GetVertices()
```

Visual Basic
---
```text
Public Function GetVertices As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetVertices()
```

# Remarks
A container with three integers (indices of the vertices) is returned.
# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace